{"config": [{"config": {"output_dim": 4, "W_constraint": null, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "trainable": true, "input_dtype": "float32", "input_dim": null, "name": "dense_1", "b_constraint": null, "batch_input_shape": [null, 4], "activation": "linear", "b_regularizer": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}, "class_name": "Activation"}, {"config": {"output_dim": 3, "W_constraint": null, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "trainable": true, "input_dim": null, "name": "dense_2", "b_constraint": null, "activation": "linear", "b_regularizer": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_2", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "keras_version": "1.0.7", "class_name": "Sequential"}